docs/Blog/Make-company-mode-support-for-nginx-mode.org
# Created 2021-07-18 Sun 07:53
#+TITLE: Make company-mode support for nginx-mode
#+AUTHOR: stardiviner

* At the beginning
:PROPERTIES:
:ID:       656815d3-f5ed-4d62-944f-9e21c4ef8185
:PUBDATE:  <2019-08-14 Wed 19:08>
:END:

I'm learning a little about Nginx recently, I hope can setup web server by myself
when someday I want to build up a website for startup or something else.

Like Ansible, Terraform, they all have keywords completions support.

Emacs already has an major mode =nginx-mode=, but it does not provide Nginx directives
completion. I know =company-mode= has ~company-keywords-alist~. So I can support for Nginx
too.


* Fetch all Nginx directives
:PROPERTIES:
:ID:       63351be9-d9a8-4553-91c8-956bf458cf8a
:PUBDATE:  <2019-08-14 Wed 19:08>
:END:

** TODO Elisp implementation
:PROPERTIES:
:ID:       541fd566-a66c-442a-aaf1-3b0939946fea
:END:
:LOGBOOK:
- State "TODO"       from              [2018-05-14 Mon 11:08]
:END:

#+begin_src emacs-lisp :eval no
(require 'elquery)

(with-current-buffer (url-retrieve-synchronously "https://nginx.org/en/docs/dirindex.html")
  (message "%S"
           (elquery-$ "body #main #content p"
                      (elquery-read-string (buffer-string)))))

(let ((html (with-current-buffer
                (set-buffer-multibyte nil)
              (url-retrieve-synchronously "https://nginx.org/en/docs/dirindex.html")
              (elquery-read-string
               (buffer-string)))))
  (elquery-$ "#content p" html))
#+end_src

*NOTE*: This version does not work, because some low-level reason.

https://github.com/AdamNiederer/elquery/issues/5

