Blog/Make-company-mode-support-for-nginx-mode.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-07 Thu 19:57 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Make company-mode support for nginx-mode</title>
<meta name="generator" content="Org mode">
<meta name="author" content="stardiviner">
<link rel="stylesheet" type="text/css" href="/assets/stylesheets/stylesheet.css"/><link rel="stylesheet" type="text/css" href="/assets/stylesheets/syntax-highlight.css"/><link rel="alternate" type="application/rss+xml" href="https://stardiviner.github.io/Blog/index.xml"><link ref="icon" type="image/png" href="/assets/images/favicon-16x16.png" sizes="16x16"><link ref="icon" type="image/png" href="/assets/images/favicon-32x32.png" sizes="32x32">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://stardiviner.github.io/"> HOME </a>
</div><div id="preamble" class="status">
<div class='nav'>
  <ul>
    <li><a href='/'>Home</a></li>
    <li><a href='/Blog/index.html'>Blog</a></li>
    <li><a href='/index.xml'>Blog RSS</a></li>
    <li><a href="/Thought/index.html">Thought</a></li>
    <li><a href='/Literature/index.html'>文学</a></li>
    <li><a href='/About/index.html'>About</a></li>
  </ul>
</div>
</div>
<div id="content">
<header>
<h1 class="title">Make company-mode support for nginx-mode</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org395f98b">1. At the beginning</a></li>
<li><a href="#org7cd6287">2. Fetch all Nginx directives</a>
<ul>
<li><a href="#org01bc024">2.1. <span class="todo TODO">TODO</span> Elisp implementation</a></li>
<li><a href="#org778c4bf">2.2. another Python implementation</a></li>
</ul>
</li>
<li><a href="#org29b7ff4">3. company-keywords-alist</a></li>
<li><a href="#org54cc418">4. created package company-nginx</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org395f98b" class="outline-2">
<h2 id="org395f98b"><span class="section-number-2">1</span> At the beginning</h2>
<div class="outline-text-2" id="text-1">
<p>
I'm learning a little about Nginx recently, I hope can setup web server by myself
when someday I want to build up a website for startup or something else.
</p>

<p>
Like Ansible, Terraform, they all have keywords completions support.
</p>

<p>
Emacs already has an major mode <code>nginx-mode</code>, but it does not provide Nginx directives
completion. I know <code>company-mode</code> has <code>company-keywords-alist</code>. So I can support for Nginx
too.
</p>
</div>
</div>


<div id="outline-container-org7cd6287" class="outline-2">
<h2 id="org7cd6287"><span class="section-number-2">2</span> Fetch all Nginx directives</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org01bc024" class="outline-3">
<h3 id="org01bc024"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Elisp implementation</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #56B6C2;">(</span><span style="color: #E06C75;">require</span> '<span style="color: #98C379;">elquery</span><span style="color: #56B6C2;">)</span>

<span style="color: #56B6C2;">(</span><span style="color: #E06C75;">with-current-buffer</span> <span style="color: #D19A66;">(</span>url-retrieve-synchronously <span style="color: #98C379;">"https://nginx.org/en/docs/dirindex.html"</span><span style="color: #D19A66;">)</span>
  <span style="color: #D19A66;">(</span>message <span style="color: #98C379;">"%S"</span>
           <span style="color: #61AFEF;">(</span>elquery-$ <span style="color: #98C379;">"body #main #content p"</span>
                      <span style="color: #C678DD;">(</span>elquery-read-string <span style="color: #98C379;">(</span>buffer-string<span style="color: #98C379;">)</span><span style="color: #C678DD;">)</span><span style="color: #61AFEF;">)</span><span style="color: #D19A66;">)</span><span style="color: #56B6C2;">)</span>

<span style="color: #56B6C2;">(</span><span style="color: #E06C75;">let</span> <span style="color: #D19A66;">(</span><span style="color: #61AFEF;">(</span>html <span style="color: #C678DD;">(</span><span style="color: #E06C75;">with-current-buffer</span>
                <span style="color: #98C379;">(</span>set-buffer-multibyte nil<span style="color: #98C379;">)</span>
              <span style="color: #98C379;">(</span>url-retrieve-synchronously <span style="color: #98C379;">"https://nginx.org/en/docs/dirindex.html"</span><span style="color: #98C379;">)</span>
              <span style="color: #98C379;">(</span>elquery-read-string
               <span style="color: #BE5046;">(</span>buffer-string<span style="color: #BE5046;">)</span><span style="color: #98C379;">)</span><span style="color: #C678DD;">)</span><span style="color: #61AFEF;">)</span><span style="color: #D19A66;">)</span>
  <span style="color: #D19A66;">(</span>elquery-$ <span style="color: #98C379;">"#content p"</span> html<span style="color: #D19A66;">)</span><span style="color: #56B6C2;">)</span>
</pre>
</div>

<p>
<b>NOTE</b>: This version does not work, because some low-level reason.
</p>

<p>
<a href="https://github.com/AdamNiederer/elquery/issues/5">https://github.com/AdamNiederer/elquery/issues/5</a>
</p>
</div>
</div>
