Blog/Make-company-mode-support-for-nginx-mode.html


<div id="outline-container-org29b7ff4" class="outline-2">
<h2 id="org29b7ff4"><span class="section-number-2">3</span> company-keywords-alist</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #56B6C2;">(</span><span style="color: #E06C75;">defun</span> <span style="color: #61AFEF;">company-nginx-keywords</span> <span style="color: #D19A66;">()</span>
  <span style="color: #D19A66;">(</span>add-to-list 'company-keywords-alist
               '<span style="color: #61AFEF;">(</span>nginx-mode
                 <span style="color: #98C379;">"absolute_redirect"</span> <span style="color: #98C379;">"accept_mutex"</span> <span style="color: #98C379;">"accept_mutex_delay"</span> <span style="color: #98C379;">"access_log"</span> <span style="color: #98C379;">"access_log"</span>
                 <span style="color: #98C379;">"add_after_body"</span> <span style="color: #98C379;">"add_before_body"</span> <span style="color: #98C379;">"add_header"</span> <span style="color: #98C379;">"add_trailer"</span> <span style="color: #98C379;">"addition_types"</span> <span style="color: #98C379;">"aio"</span>
                 <span style="color: #98C379;">"aio_write"</span> <span style="color: #98C379;">"alias"</span> <span style="color: #98C379;">"allow"</span> <span style="color: #98C379;">"allow"</span> <span style="color: #98C379;">"ancient_browser"</span> <span style="color: #98C379;">"ancient_browser_value"</span> <span style="color: #98C379;">"api"</span>
                 <span style="color: #98C379;">"auth_basic"</span> <span style="color: #98C379;">"auth_basic_user_file"</span> <span style="color: #98C379;">"auth_http"</span> <span style="color: #98C379;">"auth_http_header"</span>
                 <span style="color: #98C379;">"auth_http_pass_client_cert"</span> <span style="color: #98C379;">"auth_http_timeout"</span> <span style="color: #98C379;">"auth_jwt"</span> <span style="color: #98C379;">"auth_jwt_claim_set"</span>
                 <span style="color: #98C379;">"auth_jwt_header_set"</span> <span style="color: #98C379;">"auth_jwt_key_file"</span> <span style="color: #98C379;">"auth_jwt_leeway"</span> <span style="color: #98C379;">"auth_request"</span>
                 <span style="color: #98C379;">"auth_request_set"</span> <span style="color: #98C379;">"autoindex"</span> <span style="color: #98C379;">"autoindex_exact_size"</span> <span style="color: #98C379;">"autoindex_format"</span>
                 <span style="color: #98C379;">"autoindex_localtime"</span> <span style="color: #98C379;">"break"</span> <span style="color: #98C379;">"charset"</span> <span style="color: #98C379;">"charset_map"</span> <span style="color: #98C379;">"charset_types"</span>
                 <span style="color: #98C379;">"chunked_transfer_encoding"</span> <span style="color: #98C379;">"client_body_buffer_size"</span> <span style="color: #98C379;">"client_body_in_file_only"</span>
                 <span style="color: #98C379;">"client_body_in_single_buffer"</span> <span style="color: #98C379;">"client_body_temp_path"</span> <span style="color: #98C379;">"client_body_timeout"</span>
                 <span style="color: #98C379;">"client_header_buffer_size"</span> <span style="color: #98C379;">"client_header_timeout"</span> <span style="color: #98C379;">"client_max_body_size"</span>
                 <span style="color: #98C379;">"connection_pool_size"</span> <span style="color: #98C379;">"create_full_put_path"</span> <span style="color: #98C379;">"daemon"</span> <span style="color: #98C379;">"dav_access"</span> <span style="color: #98C379;">"dav_methods"</span>
                 <span style="color: #98C379;">"debug_connection"</span> <span style="color: #98C379;">"debug_points"</span> <span style="color: #98C379;">"default_type"</span> <span style="color: #98C379;">"deny"</span> <span style="color: #98C379;">"deny"</span> <span style="color: #98C379;">"directio"</span>
                 <span style="color: #98C379;">"directio_alignment"</span> <span style="color: #98C379;">"disable_symlinks"</span> <span style="color: #98C379;">"empty_gif"</span> <span style="color: #98C379;">"env"</span> <span style="color: #98C379;">"error_log"</span> <span style="color: #98C379;">"error_page"</span> <span style="color: #98C379;">"etag"</span>
                 <span style="color: #98C379;">"events"</span> <span style="color: #98C379;">"expires"</span> <span style="color: #98C379;">"f4f"</span> <span style="color: #98C379;">"f4f_buffer_size"</span> <span style="color: #98C379;">"fastcgi_bind"</span> <span style="color: #98C379;">"fastcgi_buffer_size"</span>
                 <span style="color: #98C379;">"fastcgi_buffering"</span> <span style="color: #98C379;">"fastcgi_buffers"</span> <span style="color: #98C379;">"fastcgi_busy_buffers_size"</span> <span style="color: #98C379;">"fastcgi_cache"</span>
                 <span style="color: #98C379;">"fastcgi_cache_background_update"</span> <span style="color: #98C379;">"fastcgi_cache_bypass"</span> <span style="color: #98C379;">"fastcgi_cache_key"</span>
                 <span style="color: #98C379;">"fastcgi_cache_lock"</span> <span style="color: #98C379;">"fastcgi_cache_lock_age"</span> <span style="color: #98C379;">"fastcgi_cache_lock_timeout"</span>
                 <span style="color: #98C379;">"fastcgi_cache_max_range_offset"</span> <span style="color: #98C379;">"fastcgi_cache_methods"</span> <span style="color: #98C379;">"fastcgi_cache_min_uses"</span>
                 <span style="color: #98C379;">"fastcgi_cache_path"</span> <span style="color: #98C379;">"fastcgi_cache_purge"</span> <span style="color: #98C379;">"fastcgi_cache_revalidate"</span>
                 <span style="color: #98C379;">"fastcgi_cache_use_stale"</span> <span style="color: #98C379;">"fastcgi_cache_valid"</span> <span style="color: #98C379;">"fastcgi_catch_stderr"</span>
                 <span style="color: #98C379;">"fastcgi_connect_timeout"</span> <span style="color: #98C379;">"fastcgi_force_ranges"</span> <span style="color: #98C379;">"fastcgi_hide_header"</span>
                 <span style="color: #98C379;">"fastcgi_ignore_client_abort"</span> <span style="color: #98C379;">"fastcgi_ignore_headers"</span> <span style="color: #98C379;">"fastcgi_index"</span>
                 <span style="color: #98C379;">"fastcgi_intercept_errors"</span> <span style="color: #98C379;">"fastcgi_keep_conn"</span> <span style="color: #98C379;">"fastcgi_limit_rate"</span>
                 <span style="color: #98C379;">"fastcgi_max_temp_file_size"</span> <span style="color: #98C379;">"fastcgi_next_upstream"</span> <span style="color: #98C379;">"fastcgi_next_upstream_timeout"</span>
                 <span style="color: #98C379;">"fastcgi_next_upstream_tries"</span> <span style="color: #98C379;">"fastcgi_no_cache"</span> <span style="color: #98C379;">"fastcgi_param"</span> <span style="color: #98C379;">"fastcgi_pass"</span>
                 <span style="color: #98C379;">"fastcgi_pass_header"</span> <span style="color: #98C379;">"fastcgi_pass_request_body"</span> <span style="color: #98C379;">"fastcgi_pass_request_headers"</span>
                 <span style="color: #98C379;">"fastcgi_read_timeout"</span> <span style="color: #98C379;">"fastcgi_request_buffering"</span> <span style="color: #98C379;">"fastcgi_send_lowat"</span>
                 <span style="color: #98C379;">"fastcgi_send_timeout"</span> <span style="color: #98C379;">"fastcgi_split_path_info"</span> <span style="color: #98C379;">"fastcgi_store"</span> <span style="color: #98C379;">"fastcgi_store_access"</span>
                 <span style="color: #98C379;">"fastcgi_temp_file_write_size"</span> <span style="color: #98C379;">"fastcgi_temp_path"</span> <span style="color: #98C379;">"flv"</span> <span style="color: #98C379;">"geo"</span> <span style="color: #98C379;">"geo"</span> <span style="color: #98C379;">"geoip_city"</span>
                 <span style="color: #98C379;">"geoip_city"</span> <span style="color: #98C379;">"geoip_country"</span> <span style="color: #98C379;">"geoip_country"</span> <span style="color: #98C379;">"geoip_org"</span> <span style="color: #98C379;">"geoip_org"</span> <span style="color: #98C379;">"geoip_proxy"</span>
                 <span style="color: #98C379;">"geoip_proxy_recursive"</span> <span style="color: #98C379;">"google_perftools_profiles"</span> <span style="color: #98C379;">"grpc_bind"</span> <span style="color: #98C379;">"grpc_buffer_size"</span>
                 <span style="color: #98C379;">"grpc_connect_timeout"</span> <span style="color: #98C379;">"grpc_hide_header"</span> <span style="color: #98C379;">"grpc_ignore_headers"</span> <span style="color: #98C379;">"grpc_intercept_errors"</span>
                 <span style="color: #98C379;">"grpc_next_upstream"</span> <span style="color: #98C379;">"grpc_next_upstream_timeout"</span> <span style="color: #98C379;">"grpc_next_upstream_tries"</span> <span style="color: #98C379;">"grpc_pass"</span>
                 <span style="color: #98C379;">"grpc_pass_header"</span> <span style="color: #98C379;">"grpc_read_timeout"</span> <span style="color: #98C379;">"grpc_send_timeout"</span> <span style="color: #98C379;">"grpc_set_header"</span>
                 <span style="color: #98C379;">"grpc_ssl_certificate"</span> <span style="color: #98C379;">"grpc_ssl_certificate_key"</span> <span style="color: #98C379;">"grpc_ssl_ciphers"</span> <span style="color: #98C379;">"grpc_ssl_crl"</span>
                 <span style="color: #98C379;">"grpc_ssl_name"</span> <span style="color: #98C379;">"grpc_ssl_password_file"</span> <span style="color: #98C379;">"grpc_ssl_protocols"</span> <span style="color: #98C379;">"grpc_ssl_server_name"</span>
                 <span style="color: #98C379;">"grpc_ssl_session_reuse"</span> <span style="color: #98C379;">"grpc_ssl_trusted_certificate"</span> <span style="color: #98C379;">"grpc_ssl_verify"</span>
                 <span style="color: #98C379;">"grpc_ssl_verify_depth"</span> <span style="color: #98C379;">"gunzip"</span> <span style="color: #98C379;">"gunzip_buffers"</span> <span style="color: #98C379;">"gzip"</span> <span style="color: #98C379;">"gzip_buffers"</span> <span style="color: #98C379;">"gzip_comp_level"</span>
                 <span style="color: #98C379;">"gzip_disable"</span> <span style="color: #98C379;">"gzip_http_version"</span> <span style="color: #98C379;">"gzip_min_length"</span> <span style="color: #98C379;">"gzip_proxied"</span> <span style="color: #98C379;">"gzip_static"</span>
                 <span style="color: #98C379;">"gzip_types"</span> <span style="color: #98C379;">"gzip_vary"</span> <span style="color: #98C379;">"hash"</span> <span style="color: #98C379;">"hash"</span> <span style="color: #98C379;">"health_check"</span> <span style="color: #98C379;">"health_check"</span>
                 <span style="color: #98C379;">"health_check_timeout"</span> <span style="color: #98C379;">"hls"</span> <span style="color: #98C379;">"hls_buffers"</span> <span style="color: #98C379;">"hls_forward_args"</span> <span style="color: #98C379;">"hls_fragment"</span>
                 <span style="color: #98C379;">"hls_mp4_buffer_size"</span> <span style="color: #98C379;">"hls_mp4_max_buffer_size"</span> <span style="color: #98C379;">"http"</span> <span style="color: #98C379;">"http2_body_preread_size"</span>
                 <span style="color: #98C379;">"http2_chunk_size"</span> <span style="color: #98C379;">"http2_idle_timeout"</span> <span style="color: #98C379;">"http2_max_concurrent_pushes"</span>
                 <span style="color: #98C379;">"http2_max_concurrent_streams"</span> <span style="color: #98C379;">"http2_max_field_size"</span> <span style="color: #98C379;">"http2_max_header_size"</span>
                 <span style="color: #98C379;">"http2_max_requests"</span> <span style="color: #98C379;">"http2_push"</span> <span style="color: #98C379;">"http2_push_preload"</span> <span style="color: #98C379;">"http2_recv_buffer_size"</span>
                 <span style="color: #98C379;">"http2_recv_timeout"</span> <span style="color: #98C379;">"if"</span> <span style="color: #98C379;">"if_modified_since"</span> <span style="color: #98C379;">"ignore_invalid_headers"</span> <span style="color: #98C379;">"image_filter"</span>
                 <span style="color: #98C379;">"image_filter_buffer"</span> <span style="color: #98C379;">"image_filter_interlace"</span> <span style="color: #98C379;">"image_filter_jpeg_quality"</span>
                 <span style="color: #98C379;">"image_filter_sharpen"</span> <span style="color: #98C379;">"image_filter_transparency"</span> <span style="color: #98C379;">"image_filter_webp_quality"</span> <span style="color: #98C379;">"imap_auth"</span>
                 <span style="color: #98C379;">"imap_capabilities"</span> <span style="color: #98C379;">"imap_client_buffer"</span> <span style="color: #98C379;">"include"</span> <span style="color: #98C379;">"index"</span> <span style="color: #98C379;">"internal"</span> <span style="color: #98C379;">"ip_hash"</span>
                 <span style="color: #98C379;">"js_access"</span> <span style="color: #98C379;">"js_content"</span> <span style="color: #98C379;">"js_filter"</span> <span style="color: #98C379;">"js_include"</span> <span style="color: #98C379;">"js_include"</span> <span style="color: #98C379;">"js_preread"</span> <span style="color: #98C379;">"js_set"</span>
                 <span style="color: #98C379;">"js_set"</span> <span style="color: #98C379;">"keepalive"</span> <span style="color: #98C379;">"keepalive_disable"</span> <span style="color: #98C379;">"keepalive_requests"</span> <span style="color: #98C379;">"keepalive_timeout"</span> <span style="color: #98C379;">"keyval"</span>
                 <span style="color: #98C379;">"keyval"</span> <span style="color: #98C379;">"keyval_zone"</span> <span style="color: #98C379;">"keyval_zone"</span> <span style="color: #98C379;">"large_client_header_buffers"</span> <span style="color: #98C379;">"least_conn"</span>
                 <span style="color: #98C379;">"least_conn"</span> <span style="color: #98C379;">"least_time"</span> <span style="color: #98C379;">"least_time"</span> <span style="color: #98C379;">"limit_conn"</span> <span style="color: #98C379;">"limit_conn"</span> <span style="color: #98C379;">"limit_conn_log_level"</span>
                 <span style="color: #98C379;">"limit_conn_log_level"</span> <span style="color: #98C379;">"limit_conn_status"</span> <span style="color: #98C379;">"limit_conn_zone"</span> <span style="color: #98C379;">"limit_conn_zone"</span>
                 <span style="color: #98C379;">"limit_except"</span> <span style="color: #98C379;">"limit_rate"</span> <span style="color: #98C379;">"limit_rate_after"</span> <span style="color: #98C379;">"limit_req"</span> <span style="color: #98C379;">"limit_req_log_level"</span>
                 <span style="color: #98C379;">"limit_req_status"</span> <span style="color: #98C379;">"limit_req_zone"</span> <span style="color: #98C379;">"limit_zone"</span> <span style="color: #98C379;">"lingering_close"</span> <span style="color: #98C379;">"lingering_time"</span>
                 <span style="color: #98C379;">"lingering_timeout"</span> <span style="color: #98C379;">"listen"</span> <span style="color: #98C379;">"listen"</span> <span style="color: #98C379;">"listen"</span> <span style="color: #98C379;">"load_module"</span> <span style="color: #98C379;">"location"</span> <span style="color: #98C379;">"lock_file"</span>
                 <span style="color: #98C379;">"log_format"</span> <span style="color: #98C379;">"log_format"</span> <span style="color: #98C379;">"log_not_found"</span> <span style="color: #98C379;">"log_subrequest"</span> <span style="color: #98C379;">"mail"</span> <span style="color: #98C379;">"map"</span> <span style="color: #98C379;">"map"</span>
                 <span style="color: #98C379;">"map_hash_bucket_size"</span> <span style="color: #98C379;">"map_hash_bucket_size"</span> <span style="color: #98C379;">"map_hash_max_size"</span> <span style="color: #98C379;">"map_hash_max_size"</span>
                 <span style="color: #98C379;">"master_process"</span> <span style="color: #98C379;">"match"</span> <span style="color: #98C379;">"match"</span> <span style="color: #98C379;">"max_ranges"</span> <span style="color: #98C379;">"memcached_bind"</span> <span style="color: #98C379;">"memcached_buffer_size"</span>
                 <span style="color: #98C379;">"memcached_connect_timeout"</span> <span style="color: #98C379;">"memcached_force_ranges"</span> <span style="color: #98C379;">"memcached_gzip_flag"</span>
                 <span style="color: #98C379;">"memcached_next_upstream"</span> <span style="color: #98C379;">"memcached_next_upstream_timeout"</span>
                 <span style="color: #98C379;">"memcached_next_upstream_tries"</span> <span style="color: #98C379;">"memcached_pass"</span> <span style="color: #98C379;">"memcached_read_timeout"</span>
                 <span style="color: #98C379;">"memcached_send_timeout"</span> <span style="color: #98C379;">"merge_slashes"</span> <span style="color: #98C379;">"min_delete_depth"</span> <span style="color: #98C379;">"mirror"</span> <span style="color: #98C379;">"mirror_request_body"</span>
                 <span style="color: #98C379;">"modern_browser"</span> <span style="color: #98C379;">"modern_browser_value"</span> <span style="color: #98C379;">"mp4"</span> <span style="color: #98C379;">"mp4_buffer_size"</span> <span style="color: #98C379;">"mp4_limit_rate"</span>
                 <span style="color: #98C379;">"mp4_limit_rate_after"</span> <span style="color: #98C379;">"mp4_max_buffer_size"</span> <span style="color: #98C379;">"msie_padding"</span> <span style="color: #98C379;">"msie_refresh"</span> <span style="color: #98C379;">"multi_accept"</span>
                 <span style="color: #98C379;">"ntlm"</span> <span style="color: #98C379;">"open_file_cache"</span> <span style="color: #98C379;">"open_file_cache_errors"</span> <span style="color: #98C379;">"open_file_cache_min_uses"</span>
                 <span style="color: #98C379;">"open_file_cache_valid"</span> <span style="color: #98C379;">"open_log_file_cache"</span> <span style="color: #98C379;">"open_log_file_cache"</span> <span style="color: #98C379;">"output_buffers"</span>
                 <span style="color: #98C379;">"override_charset"</span> <span style="color: #98C379;">"pcre_jit"</span> <span style="color: #98C379;">"perl"</span> <span style="color: #98C379;">"perl_modules"</span> <span style="color: #98C379;">"perl_require"</span> <span style="color: #98C379;">"perl_set"</span> <span style="color: #98C379;">"pid"</span>
                 <span style="color: #98C379;">"pop3_auth"</span> <span style="color: #98C379;">"pop3_capabilities"</span> <span style="color: #98C379;">"port_in_redirect"</span> <span style="color: #98C379;">"postpone_output"</span> <span style="color: #98C379;">"preread_buffer_size"</span>
                 <span style="color: #98C379;">"preread_timeout"</span> <span style="color: #98C379;">"protocol"</span> <span style="color: #98C379;">"proxy_bind"</span> <span style="color: #98C379;">"proxy_bind"</span> <span style="color: #98C379;">"proxy_buffer"</span> <span style="color: #98C379;">"proxy_buffer_size"</span>
                 <span style="color: #98C379;">"proxy_buffer_size"</span> <span style="color: #98C379;">"proxy_buffering"</span> <span style="color: #98C379;">"proxy_buffers"</span> <span style="color: #98C379;">"proxy_busy_buffers_size"</span>
                 <span style="color: #98C379;">"proxy_cache"</span> <span style="color: #98C379;">"proxy_cache_background_update"</span> <span style="color: #98C379;">"proxy_cache_bypass"</span>
                 <span style="color: #98C379;">"proxy_cache_convert_head"</span> <span style="color: #98C379;">"proxy_cache_key"</span> <span style="color: #98C379;">"proxy_cache_lock"</span> <span style="color: #98C379;">"proxy_cache_lock_age"</span>
                 <span style="color: #98C379;">"proxy_cache_lock_timeout"</span> <span style="color: #98C379;">"proxy_cache_max_range_offset"</span> <span style="color: #98C379;">"proxy_cache_methods"</span>
                 <span style="color: #98C379;">"proxy_cache_min_uses"</span> <span style="color: #98C379;">"proxy_cache_path"</span> <span style="color: #98C379;">"proxy_cache_purge"</span> <span style="color: #98C379;">"proxy_cache_revalidate"</span>
                 <span style="color: #98C379;">"proxy_cache_use_stale"</span> <span style="color: #98C379;">"proxy_cache_valid"</span> <span style="color: #98C379;">"proxy_connect_timeout"</span>
                 <span style="color: #98C379;">"proxy_connect_timeout"</span> <span style="color: #98C379;">"proxy_cookie_domain"</span> <span style="color: #98C379;">"proxy_cookie_path"</span> <span style="color: #98C379;">"proxy_download_rate"</span>
                 <span style="color: #98C379;">"proxy_force_ranges"</span> <span style="color: #98C379;">"proxy_headers_hash_bucket_size"</span> <span style="color: #98C379;">"proxy_headers_hash_max_size"</span>
                 <span style="color: #98C379;">"proxy_hide_header"</span> <span style="color: #98C379;">"proxy_http_version"</span> <span style="color: #98C379;">"proxy_ignore_client_abort"</span>
                 <span style="color: #98C379;">"proxy_ignore_headers"</span> <span style="color: #98C379;">"proxy_intercept_errors"</span> <span style="color: #98C379;">"proxy_limit_rate"</span>
                 <span style="color: #98C379;">"proxy_max_temp_file_size"</span> <span style="color: #98C379;">"proxy_method"</span> <span style="color: #98C379;">"proxy_next_upstream"</span> <span style="color: #98C379;">"proxy_next_upstream"</span>
                 <span style="color: #98C379;">"proxy_next_upstream_timeout"</span> <span style="color: #98C379;">"proxy_next_upstream_timeout"</span> <span style="color: #98C379;">"proxy_next_upstream_tries"</span>
                 <span style="color: #98C379;">"proxy_next_upstream_tries"</span> <span style="color: #98C379;">"proxy_no_cache"</span> <span style="color: #98C379;">"proxy_pass"</span> <span style="color: #98C379;">"proxy_pass"</span>
                 <span style="color: #98C379;">"proxy_pass_error_message"</span> <span style="color: #98C379;">"proxy_pass_header"</span> <span style="color: #98C379;">"proxy_pass_request_body"</span>
                 <span style="color: #98C379;">"proxy_pass_request_headers"</span> <span style="color: #98C379;">"proxy_protocol"</span> <span style="color: #98C379;">"proxy_protocol_timeout"</span>
                 <span style="color: #98C379;">"proxy_read_timeout"</span> <span style="color: #98C379;">"proxy_redirect"</span> <span style="color: #98C379;">"proxy_request_buffering"</span> <span style="color: #98C379;">"proxy_responses"</span>
                 <span style="color: #98C379;">"proxy_send_lowat"</span> <span style="color: #98C379;">"proxy_send_timeout"</span> <span style="color: #98C379;">"proxy_set_body"</span> <span style="color: #98C379;">"proxy_set_header"</span> <span style="color: #98C379;">"proxy_ssl"</span>
                 <span style="color: #98C379;">"proxy_ssl_certificate"</span> <span style="color: #98C379;">"proxy_ssl_certificate"</span> <span style="color: #98C379;">"proxy_ssl_certificate_key"</span>
                 <span style="color: #98C379;">"proxy_ssl_certificate_key"</span> <span style="color: #98C379;">"proxy_ssl_ciphers"</span> <span style="color: #98C379;">"proxy_ssl_ciphers"</span> <span style="color: #98C379;">"proxy_ssl_crl"</span>
                 <span style="color: #98C379;">"proxy_ssl_crl"</span> <span style="color: #98C379;">"proxy_ssl_name"</span> <span style="color: #98C379;">"proxy_ssl_name"</span> <span style="color: #98C379;">"proxy_ssl_password_file"</span>
                 <span style="color: #98C379;">"proxy_ssl_password_file"</span> <span style="color: #98C379;">"proxy_ssl_protocols"</span> <span style="color: #98C379;">"proxy_ssl_protocols"</span>
                 <span style="color: #98C379;">"proxy_ssl_server_name"</span> <span style="color: #98C379;">"proxy_ssl_server_name"</span> <span style="color: #98C379;">"proxy_ssl_session_reuse"</span>
                 <span style="color: #98C379;">"proxy_ssl_session_reuse"</span> <span style="color: #98C379;">"proxy_ssl_trusted_certificate"</span> <span style="color: #98C379;">"proxy_ssl_trusted_certificate"</span>
                 <span style="color: #98C379;">"proxy_ssl_verify"</span> <span style="color: #98C379;">"proxy_ssl_verify"</span> <span style="color: #98C379;">"proxy_ssl_verify_depth"</span> <span style="color: #98C379;">"proxy_ssl_verify_depth"</span>
                 <span style="color: #98C379;">"proxy_store"</span> <span style="color: #98C379;">"proxy_store_access"</span> <span style="color: #98C379;">"proxy_temp_file_write_size"</span> <span style="color: #98C379;">"proxy_temp_path"</span>
                 <span style="color: #98C379;">"proxy_timeout"</span> <span style="color: #98C379;">"proxy_timeout"</span> <span style="color: #98C379;">"proxy_upload_rate"</span> <span style="color: #98C379;">"queue"</span> <span style="color: #98C379;">"random_index"</span> <span style="color: #98C379;">"read_ahead"</span>
                 <span style="color: #98C379;">"real_ip_header"</span> <span style="color: #98C379;">"real_ip_recursive"</span> <span style="color: #98C379;">"recursive_error_pages"</span> <span style="color: #98C379;">"referer_hash_bucket_size"</span>
                 <span style="color: #98C379;">"referer_hash_max_size"</span> <span style="color: #98C379;">"request_pool_size"</span> <span style="color: #98C379;">"reset_timedout_connection"</span> <span style="color: #98C379;">"resolver"</span>
                 <span style="color: #98C379;">"resolver"</span> <span style="color: #98C379;">"resolver"</span> <span style="color: #98C379;">"resolver_timeout"</span> <span style="color: #98C379;">"resolver_timeout"</span> <span style="color: #98C379;">"resolver_timeout"</span> <span style="color: #98C379;">"return"</span>
                 <span style="color: #98C379;">"return"</span> <span style="color: #98C379;">"rewrite"</span> <span style="color: #98C379;">"rewrite_log"</span> <span style="color: #98C379;">"root"</span> <span style="color: #98C379;">"satisfy"</span> <span style="color: #98C379;">"scgi_bind"</span> <span style="color: #98C379;">"scgi_buffer_size"</span>
                 <span style="color: #98C379;">"scgi_buffering"</span> <span style="color: #98C379;">"scgi_buffers"</span> <span style="color: #98C379;">"scgi_busy_buffers_size"</span> <span style="color: #98C379;">"scgi_cache"</span>
                 <span style="color: #98C379;">"scgi_cache_background_update"</span> <span style="color: #98C379;">"scgi_cache_bypass"</span> <span style="color: #98C379;">"scgi_cache_key"</span> <span style="color: #98C379;">"scgi_cache_lock"</span>
                 <span style="color: #98C379;">"scgi_cache_lock_age"</span> <span style="color: #98C379;">"scgi_cache_lock_timeout"</span> <span style="color: #98C379;">"scgi_cache_max_range_offset"</span>
                 <span style="color: #98C379;">"scgi_cache_methods"</span> <span style="color: #98C379;">"scgi_cache_min_uses"</span> <span style="color: #98C379;">"scgi_cache_path"</span> <span style="color: #98C379;">"scgi_cache_purge"</span>
                 <span style="color: #98C379;">"scgi_cache_revalidate"</span> <span style="color: #98C379;">"scgi_cache_use_stale"</span> <span style="color: #98C379;">"scgi_cache_valid"</span> <span style="color: #98C379;">"scgi_connect_timeout"</span>
                 <span style="color: #98C379;">"scgi_force_ranges"</span> <span style="color: #98C379;">"scgi_hide_header"</span> <span style="color: #98C379;">"scgi_ignore_client_abort"</span> <span style="color: #98C379;">"scgi_ignore_headers"</span>
                 <span style="color: #98C379;">"scgi_intercept_errors"</span> <span style="color: #98C379;">"scgi_limit_rate"</span> <span style="color: #98C379;">"scgi_max_temp_file_size"</span> <span style="color: #98C379;">"scgi_next_upstream"</span>
                 <span style="color: #98C379;">"scgi_next_upstream_timeout"</span> <span style="color: #98C379;">"scgi_next_upstream_tries"</span> <span style="color: #98C379;">"scgi_no_cache"</span> <span style="color: #98C379;">"scgi_param"</span>
                 <span style="color: #98C379;">"scgi_pass"</span> <span style="color: #98C379;">"scgi_pass_header"</span> <span style="color: #98C379;">"scgi_pass_request_body"</span> <span style="color: #98C379;">"scgi_pass_request_headers"</span>
                 <span style="color: #98C379;">"scgi_read_timeout"</span> <span style="color: #98C379;">"scgi_request_buffering"</span> <span style="color: #98C379;">"scgi_send_timeout"</span> <span style="color: #98C379;">"scgi_store"</span>
                 <span style="color: #98C379;">"scgi_store_access"</span> <span style="color: #98C379;">"scgi_temp_file_write_size"</span> <span style="color: #98C379;">"scgi_temp_path"</span> <span style="color: #98C379;">"secure_link"</span>
                 <span style="color: #98C379;">"secure_link_md5"</span> <span style="color: #98C379;">"secure_link_secret"</span> <span style="color: #98C379;">"send_lowat"</span> <span style="color: #98C379;">"send_timeout"</span> <span style="color: #98C379;">"sendfile"</span>
                 <span style="color: #98C379;">"sendfile_max_chunk"</span> <span style="color: #98C379;">"server"</span> <span style="color: #98C379;">"server"</span> <span style="color: #98C379;">"server"</span> <span style="color: #98C379;">"server"</span> <span style="color: #98C379;">"server"</span> <span style="color: #98C379;">"server_name"</span>
                 <span style="color: #98C379;">"server_name"</span> <span style="color: #98C379;">"server_name_in_redirect"</span> <span style="color: #98C379;">"server_names_hash_bucket_size"</span>
                 <span style="color: #98C379;">"server_names_hash_max_size"</span> <span style="color: #98C379;">"server_tokens"</span> <span style="color: #98C379;">"session_log"</span> <span style="color: #98C379;">"session_log_format"</span>
                 <span style="color: #98C379;">"session_log_zone"</span> <span style="color: #98C379;">"set"</span> <span style="color: #98C379;">"set_real_ip_from"</span> <span style="color: #98C379;">"set_real_ip_from"</span> <span style="color: #98C379;">"slice"</span> <span style="color: #98C379;">"smtp_auth"</span>
                 <span style="color: #98C379;">"smtp_capabilities"</span> <span style="color: #98C379;">"smtp_client_buffer"</span> <span style="color: #98C379;">"smtp_greeting_delay"</span> <span style="color: #98C379;">"source_charset"</span>
                 <span style="color: #98C379;">"spdy_chunk_size"</span> <span style="color: #98C379;">"spdy_headers_comp"</span> <span style="color: #98C379;">"split_clients"</span> <span style="color: #98C379;">"split_clients"</span> <span style="color: #98C379;">"ssi"</span>
                 <span style="color: #98C379;">"ssi_last_modified"</span> <span style="color: #98C379;">"ssi_min_file_chunk"</span> <span style="color: #98C379;">"ssi_silent_errors"</span> <span style="color: #98C379;">"ssi_types"</span>
                 <span style="color: #98C379;">"ssi_value_length"</span> <span style="color: #98C379;">"ssl"</span> <span style="color: #98C379;">"ssl"</span> <span style="color: #98C379;">"ssl_buffer_size"</span> <span style="color: #98C379;">"ssl_certificate"</span> <span style="color: #98C379;">"ssl_certificate"</span>
                 <span style="color: #98C379;">"ssl_certificate"</span> <span style="color: #98C379;">"ssl_certificate_key"</span> <span style="color: #98C379;">"ssl_certificate_key"</span> <span style="color: #98C379;">"ssl_certificate_key"</span>
                 <span style="color: #98C379;">"ssl_ciphers"</span> <span style="color: #98C379;">"ssl_ciphers"</span> <span style="color: #98C379;">"ssl_ciphers"</span> <span style="color: #98C379;">"ssl_client_certificate"</span>
                 <span style="color: #98C379;">"ssl_client_certificate"</span> <span style="color: #98C379;">"ssl_client_certificate"</span> <span style="color: #98C379;">"ssl_crl"</span> <span style="color: #98C379;">"ssl_crl"</span> <span style="color: #98C379;">"ssl_crl"</span>
                 <span style="color: #98C379;">"ssl_dhparam"</span> <span style="color: #98C379;">"ssl_dhparam"</span> <span style="color: #98C379;">"ssl_dhparam"</span> <span style="color: #98C379;">"ssl_ecdh_curve"</span> <span style="color: #98C379;">"ssl_ecdh_curve"</span>
                 <span style="color: #98C379;">"ssl_ecdh_curve"</span> <span style="color: #98C379;">"ssl_engine"</span> <span style="color: #98C379;">"ssl_handshake_timeout"</span> <span style="color: #98C379;">"ssl_password_file"</span>
                 <span style="color: #98C379;">"ssl_password_file"</span> <span style="color: #98C379;">"ssl_password_file"</span> <span style="color: #98C379;">"ssl_prefer_server_ciphers"</span>
                 <span style="color: #98C379;">"ssl_prefer_server_ciphers"</span> <span style="color: #98C379;">"ssl_prefer_server_ciphers"</span> <span style="color: #98C379;">"ssl_preread"</span> <span style="color: #98C379;">"ssl_protocols"</span>
                 <span style="color: #98C379;">"ssl_protocols"</span> <span style="color: #98C379;">"ssl_protocols"</span> <span style="color: #98C379;">"ssl_session_cache"</span> <span style="color: #98C379;">"ssl_session_cache"</span>
                 <span style="color: #98C379;">"ssl_session_cache"</span> <span style="color: #98C379;">"ssl_session_ticket_key"</span> <span style="color: #98C379;">"ssl_session_ticket_key"</span>
                 <span style="color: #98C379;">"ssl_session_ticket_key"</span> <span style="color: #98C379;">"ssl_session_tickets"</span> <span style="color: #98C379;">"ssl_session_tickets"</span> <span style="color: #98C379;">"ssl_session_tickets"</span>
                 <span style="color: #98C379;">"ssl_session_timeout"</span> <span style="color: #98C379;">"ssl_session_timeout"</span> <span style="color: #98C379;">"ssl_session_timeout"</span> <span style="color: #98C379;">"ssl_stapling"</span>
                 <span style="color: #98C379;">"ssl_stapling_file"</span> <span style="color: #98C379;">"ssl_stapling_responder"</span> <span style="color: #98C379;">"ssl_stapling_verify"</span>
                 <span style="color: #98C379;">"ssl_trusted_certificate"</span> <span style="color: #98C379;">"ssl_trusted_certificate"</span> <span style="color: #98C379;">"ssl_trusted_certificate"</span>
                 <span style="color: #98C379;">"ssl_verify_client"</span> <span style="color: #98C379;">"ssl_verify_client"</span> <span style="color: #98C379;">"ssl_verify_client"</span> <span style="color: #98C379;">"ssl_verify_depth"</span>
                 <span style="color: #98C379;">"ssl_verify_depth"</span> <span style="color: #98C379;">"ssl_verify_depth"</span> <span style="color: #98C379;">"starttls"</span> <span style="color: #98C379;">"state"</span> <span style="color: #98C379;">"state"</span> <span style="color: #98C379;">"status"</span> <span style="color: #98C379;">"status_format"</span>
                 <span style="color: #98C379;">"status_zone"</span> <span style="color: #98C379;">"sticky"</span> <span style="color: #98C379;">"sticky_cookie_insert"</span> <span style="color: #98C379;">"stream"</span> <span style="color: #98C379;">"stub_status"</span> <span style="color: #98C379;">"sub_filter"</span>
                 <span style="color: #98C379;">"sub_filter_last_modified"</span> <span style="color: #98C379;">"sub_filter_once"</span> <span style="color: #98C379;">"sub_filter_types"</span>
                 <span style="color: #98C379;">"subrequest_output_buffer_size"</span> <span style="color: #98C379;">"tcp_nodelay"</span> <span style="color: #98C379;">"tcp_nodelay"</span> <span style="color: #98C379;">"tcp_nopush"</span> <span style="color: #98C379;">"thread_pool"</span>
                 <span style="color: #98C379;">"timeout"</span> <span style="color: #98C379;">"timer_resolution"</span> <span style="color: #98C379;">"try_files"</span> <span style="color: #98C379;">"types"</span> <span style="color: #98C379;">"types_hash_bucket_size"</span>
                 <span style="color: #98C379;">"types_hash_max_size"</span> <span style="color: #98C379;">"underscores_in_headers"</span> <span style="color: #98C379;">"uninitialized_variable_warn"</span> <span style="color: #98C379;">"upstream"</span>
                 <span style="color: #98C379;">"upstream"</span> <span style="color: #98C379;">"upstream_conf"</span> <span style="color: #98C379;">"use"</span> <span style="color: #98C379;">"user"</span> <span style="color: #98C379;">"userid"</span> <span style="color: #98C379;">"userid_domain"</span> <span style="color: #98C379;">"userid_expires"</span>
                 <span style="color: #98C379;">"userid_mark"</span> <span style="color: #98C379;">"userid_name"</span> <span style="color: #98C379;">"userid_p3p"</span> <span style="color: #98C379;">"userid_path"</span> <span style="color: #98C379;">"userid_service"</span> <span style="color: #98C379;">"uwsgi_bind"</span>
                 <span style="color: #98C379;">"uwsgi_buffer_size"</span> <span style="color: #98C379;">"uwsgi_buffering"</span> <span style="color: #98C379;">"uwsgi_buffers"</span> <span style="color: #98C379;">"uwsgi_busy_buffers_size"</span>
                 <span style="color: #98C379;">"uwsgi_cache"</span> <span style="color: #98C379;">"uwsgi_cache_background_update"</span> <span style="color: #98C379;">"uwsgi_cache_bypass"</span> <span style="color: #98C379;">"uwsgi_cache_key"</span>
                 <span style="color: #98C379;">"uwsgi_cache_lock"</span> <span style="color: #98C379;">"uwsgi_cache_lock_age"</span> <span style="color: #98C379;">"uwsgi_cache_lock_timeout"</span>
                 <span style="color: #98C379;">"uwsgi_cache_max_range_offset"</span> <span style="color: #98C379;">"uwsgi_cache_methods"</span> <span style="color: #98C379;">"uwsgi_cache_min_uses"</span>
                 <span style="color: #98C379;">"uwsgi_cache_path"</span> <span style="color: #98C379;">"uwsgi_cache_purge"</span> <span style="color: #98C379;">"uwsgi_cache_revalidate"</span> <span style="color: #98C379;">"uwsgi_cache_use_stale"</span>
                 <span style="color: #98C379;">"uwsgi_cache_valid"</span> <span style="color: #98C379;">"uwsgi_connect_timeout"</span> <span style="color: #98C379;">"uwsgi_force_ranges"</span> <span style="color: #98C379;">"uwsgi_hide_header"</span>
                 <span style="color: #98C379;">"uwsgi_ignore_client_abort"</span> <span style="color: #98C379;">"uwsgi_ignore_headers"</span> <span style="color: #98C379;">"uwsgi_intercept_errors"</span>
                 <span style="color: #98C379;">"uwsgi_limit_rate"</span> <span style="color: #98C379;">"uwsgi_max_temp_file_size"</span> <span style="color: #98C379;">"uwsgi_modifier1"</span> <span style="color: #98C379;">"uwsgi_modifier2"</span>
                 <span style="color: #98C379;">"uwsgi_next_upstream"</span> <span style="color: #98C379;">"uwsgi_next_upstream_timeout"</span> <span style="color: #98C379;">"uwsgi_next_upstream_tries"</span>
                 <span style="color: #98C379;">"uwsgi_no_cache"</span> <span style="color: #98C379;">"uwsgi_param"</span> <span style="color: #98C379;">"uwsgi_pass"</span> <span style="color: #98C379;">"uwsgi_pass_header"</span> <span style="color: #98C379;">"uwsgi_pass_request_body"</span>
                 <span style="color: #98C379;">"uwsgi_pass_request_headers"</span> <span style="color: #98C379;">"uwsgi_read_timeout"</span> <span style="color: #98C379;">"uwsgi_request_buffering"</span>
                 <span style="color: #98C379;">"uwsgi_send_timeout"</span> <span style="color: #98C379;">"uwsgi_ssl_certificate"</span> <span style="color: #98C379;">"uwsgi_ssl_certificate_key"</span>
                 <span style="color: #98C379;">"uwsgi_ssl_ciphers"</span> <span style="color: #98C379;">"uwsgi_ssl_crl"</span> <span style="color: #98C379;">"uwsgi_ssl_name"</span> <span style="color: #98C379;">"uwsgi_ssl_password_file"</span>
                 <span style="color: #98C379;">"uwsgi_ssl_protocols"</span> <span style="color: #98C379;">"uwsgi_ssl_server_name"</span> <span style="color: #98C379;">"uwsgi_ssl_session_reuse"</span>
                 <span style="color: #98C379;">"uwsgi_ssl_trusted_certificate"</span> <span style="color: #98C379;">"uwsgi_ssl_verify"</span> <span style="color: #98C379;">"uwsgi_ssl_verify_depth"</span> <span style="color: #98C379;">"uwsgi_store"</span>
                 <span style="color: #98C379;">"uwsgi_store_access"</span> <span style="color: #98C379;">"uwsgi_temp_file_write_size"</span> <span style="color: #98C379;">"uwsgi_temp_path"</span> <span style="color: #98C379;">"valid_referers"</span>
                 <span style="color: #98C379;">"variables_hash_bucket_size"</span> <span style="color: #98C379;">"variables_hash_bucket_size"</span> <span style="color: #98C379;">"variables_hash_max_size"</span>
                 <span style="color: #98C379;">"variables_hash_max_size"</span> <span style="color: #98C379;">"worker_aio_requests"</span> <span style="color: #98C379;">"worker_connections"</span> <span style="color: #98C379;">"worker_cpu_affinity"</span>
                 <span style="color: #98C379;">"worker_priority"</span> <span style="color: #98C379;">"worker_processes"</span> <span style="color: #98C379;">"worker_rlimit_core"</span> <span style="color: #98C379;">"worker_rlimit_nofile"</span>
                 <span style="color: #98C379;">"worker_shutdown_timeout"</span> <span style="color: #98C379;">"working_directory"</span> <span style="color: #98C379;">"xclient"</span> <span style="color: #98C379;">"xml_entities"</span>
                 <span style="color: #98C379;">"xslt_last_modified"</span> <span style="color: #98C379;">"xslt_param"</span> <span style="color: #98C379;">"xslt_string_param"</span> <span style="color: #98C379;">"xslt_stylesheet"</span> <span style="color: #98C379;">"xslt_types"</span>
                 <span style="color: #98C379;">"zone"</span> <span style="color: #98C379;">"zone"</span> <span style="color: #98C379;">"zone_sync"</span> <span style="color: #98C379;">"zone_sync_buffers"</span> <span style="color: #98C379;">"zone_sync_connect_retry_interval"</span>
                 <span style="color: #98C379;">"zone_sync_connect_timeout"</span> <span style="color: #98C379;">"zone_sync_interval"</span> <span style="color: #98C379;">"zone_sync_recv_buffer_size"</span>
                 <span style="color: #98C379;">"zone_sync_server"</span> <span style="color: #98C379;">"zone_sync_ssl"</span> <span style="color: #98C379;">"zone_sync_ssl_certificate"</span>
                 <span style="color: #98C379;">"zone_sync_ssl_certificate_key"</span> <span style="color: #98C379;">"zone_sync_ssl_ciphers"</span> <span style="color: #98C379;">"zone_sync_ssl_crl"</span>
                 <span style="color: #98C379;">"zone_sync_ssl_password_file"</span> <span style="color: #98C379;">"zone_sync_ssl_protocols"</span>
                 <span style="color: #98C379;">"zone_sync_ssl_trusted_certificate"</span> <span style="color: #98C379;">"zone_sync_ssl_verify"</span> <span style="color: #98C379;">"zone_sync_ssl_verify_depth"</span>
                 <span style="color: #98C379;">"zone_sync_timeout"</span><span style="color: #61AFEF;">)</span><span style="color: #D19A66;">)</span><span style="color: #56B6C2;">)</span>

<span style="color: #5C6370; font-style: italic;">;;;</span><span style="color: #5C6370; font-style: italic;">###</span><span style="color: #BE5046; font-weight: bold; font-style: italic;">autoload</span>
<span style="color: #56B6C2;">(</span>eval-after-load 'nginx-mode
  '<span style="color: #D19A66;">(</span>add-hook 'nginx-mode-hook #'company-nginx-keywords<span style="color: #D19A66;">)</span><span style="color: #56B6C2;">)</span>
</pre>
</div>
</div>
</div>
